<route lang="json5" type="page">
{
  layout: 'default',
  style: {
    navigationBarTitleText: '',
    navigationStyle: 'custom',
  },
}
</route>

<template>
  <scroll-view class="page" scroll-y show-scrollbar>
    <view class="row">前言</view>
    <view class="row">
      《枕月APP隐私政策与用户服务协议》（以下简称“本协议”）由枕月APP用户（以下简称“用户”）与枕月APP开发公司神舞科技（以下简称“服务提供方”）共同缔结，服务提供方将依据本协议的规定为用户提供服务。
    </view>
    <view class="row">
      鉴于本协议具有合同效力，用户在开始使用枕月APP时务必要认真阅读本协议，在审慎阅读、充分理解各条款内容的基础上，用户可以选择接受或不接受本协议，未成年人请在法定监护人的陪同下阅读本协议并作出选择。
    </view>
    <view class="row">
      对于免除或者限制服务提供方责任的条款（以下称“免责条款”）、对用户权利进行限制的条款（以下称“限制条款”）、约定争议解决方式和司法管辖的条款，本协议可能以黑体加粗、颜色标记或其他合理方式提示用户注意，请用户在确认接受本协议之前或在使用专注测评服务之前再次阅读前述条款。
    </view>
    <view class="row">除非您已阅读并接受本协议所有条款，否则您无权使用枕月APP服务。</view>
    <view class="row">
      监护人特别说明：如果您是孩子的监护人，请您仔细阅读和选择是否同意本政策。我们希望请您与我们共同保护孩子的个人信息，教育引导孩子增强个人信息保护意识和能力，指导、提醒和要求他们在未经您同意的情况下，不向任何网络产品和服务提供者提供任何个人信息。
    </view>
    <view class="row">
      未成年人特别说明：如果你是十四周岁以下的未成年人，你需要和你的监护人一起仔细阅读本政策，并在征得你的监护人同意后，使用我们的产品、服务或向我们提供信息。
    </view>
    <view class="row">
      用户开始使用即表示用户已经阅读并愿意接受本协议项下的全部条款，用户不应再以不了解本协议内容为由拒绝履行和遵守本协议。本协议条款可由服务提供方适时更新，本协议一旦发生变动，服务提供方将会在相关页面上提示修改内容以让用户及时获得更新的协议内容，修改后的服务协议一旦在页面上公布即有效代替原来的服务协议。如果您不同意对本协议相关条款的任何变更，请立即停止使用枕月APP。
    </view>
    <view class="row">一、服务协议的确认和变更</view>
    <view class="row">
      1.本协议是您（以下简称“用户”）与枕月APP之间关于使用枕月APP服务所订立的有约束力的法律文件。
    </view>
    <view class="row">
      2.本协议的内容包括协议正文、枕月APP已发布或将来可能发布的其他声明、规则、公告。所发布的声明、规则、公告等均为本协议不可分割的组成部分，与本协议具有同等法律效力。
    </view>
    <view class="row">
      3.枕月APP可能会不定期的更新本协议，用户可在枕月APP软件内页上查阅本协议的最新版本。新协议一经公布即代替原协议。如用户不接受更新后的协议，应立即停止使用枕月APP提供的服务。
    </view>
    <view class="row">
      二、枕月APP服务内容，枕月APP是一个为用户提供冥想放松和睡眠评估管理的工具平台，服务内容包括但不限于：
    </view>
    <view class="row">1.基于脑电进行冥想放松效果评估，进行睡眠质量评估；</view>
    <view class="row">
      2.建立用户档案，收集用户的脑电波EEG（脑电）和行为信息，以追踪用户的冥想和睡眠进程。
    </view>
    <view class="row">
      3.我们严格遵守法律法规的规定以及与用户的约定，按照本政策所述使用收集的信息，以向用户提供更为优质的服务。若我们使用用户的个人信息，超出了与收集时所声称的目的及具有直接或合理关联的范围，我们将在使用个人信息前，再次向用户告知并征得您的同意。我们使用用户个人信息的方式详情如下：
    </view>
    <view class="row">
      （1）根据用户的账户信息、设备信息、使用我们服务的信息，统计和了解用户使用我们服务的情况，改善我们的产品和服务的设计和功能，优化用户体验，根据用户提供的联系方式对用户进行必要的电话回访或电子邮件、短信通知。
    </view>
    <view class="row">
      （2）为提高用户使用我们及我们合作伙伴提供服务的安全性，保护用户或其他用户或公众的人身财产安全免遭侵害，更好地预防钓鱼网站、欺诈、网络漏洞、计算机病毒、网络攻击、网络侵入等安全风险，更准确地识别违反法律法规或神舞科技相关协议规则的情况，我们可能使用或整合用户的账户信息、设备信息、应用程序使用信息以及我们合作伙伴取得用户授权或依据法律共享的信息。
    </view>
    <view class="row">
      （3）如果我们将信息用于本政策未载明的其他用途，或者将基于特定目的收集而来的信息用于其他目的，我们会事先征求您的同意。
    </view>
    <view class="row">
      （4）在不透露用户隐私资料的前提下，我们有权对整个用户信息数据库进行技术分析并将已进行分析、整理后的用户数据库进行商业上的利用。我们将采取商业上合理可行的方式保护用户个人信息的安全，利用其可以获得的安全技术和程序来保护用户的个人信息不被未经授权地访问、使用或泄漏。
    </view>
    <view class="row">三、用户使用</view>
    <view class="row">
      1.用户在使用本服务前需要填写能联系到您的手机号，其目的是为了将获取的脑电波信息和训练档案与您进行关联，方便更好地为您提供相关服务，并在对账户进行特定操作前获得您的许可；
    </view>
    <view class="row">
      2.用户在脑电设备配置、训练、填写资料时须承诺遵守法律法规、社会主义制度、国家利益、公民合法权益、公共秩序、社会道德风尚和信息真实性等七条底线，不得在资料中出现违法和不良信息，不得冒用、关联机构或社会名人，且用户保证其在使用时，特别不得有以下情形：
    </view>
    <view class="row">（1）违反宪法或法律法规规定的；</view>
    <view class="row">（2）危害国家安全，泄露国家秘密，颠覆国家政权，破坏国家统一的；</view>
    <view class="row">（3）损害国家荣誉和利益的，损害公共利益的；</view>
    <view class="row">（4）煽动民族仇恨、民族歧视，破坏民族团结的；</view>
    <view class="row">（5）破坏国家宗教政策，宣扬邪教和封建迷信的；</view>
    <view class="row">（6）散布谣言，扰乱社会秩序，破坏社会稳定的；</view>
    <view class="row">（7）散布淫秽、色情、赌博、暴力、凶杀、恐怖或者教唆犯罪的；</view>
    <view class="row">（8）侮辱或者诽谤他人，侵害他人合法权益的；</view>
    <view class="row">（9）含有法律、行政法规禁止的其他内容的。</view>
    <view class="row">
      3.枕月APP会保存用户的配置、评估、记录，含注册时间、训练时间、手机号、性别、年龄、昵称、脑电状态、训练难度、训练报告等信息，目的是在保存期间进行评估、训练效果确认，确保给用户最好的评估结果和使用效果。这些信息限于用户本人使用，禁止赠与、借用、租用、转让或售卖。这些信息可以根据用户要求及时进行清理，确保用户信息安全。
    </view>
    <view class="row">
      4.用户同意使用本服务期间，接受枕月APP提供的商业信息，提供方式包括但不限于电子邮件、手机短信等合法方式。对于上述枕月APP发送的商业信息，用户有权取消订阅或者通过其他方式拒绝推送。
    </view>
    <view class="row">四、双方权利与义务</view>
    <view class="row">
      1.用户须保证在使用枕月APP的所有行为符合法律法规、相关政策及枕月APP不定时更新的声明、规则、公告，符合公序良俗等基本社会规范。
    </view>
    <view class="row">
      2.用户承诺，非经枕月APP同意，用户不能利用枕月APP内容进行复制、销售、传播或其他除本服务外的商业用途。如用户有需要将服务用于商业用途，应书面通知枕月APP提供商并获得枕月APP提供商的明确授权。
    </view>
    <view class="row">
      3.用户承诺，不以技术方式攻击或破坏或改变枕月APP的部分或全部、或干扰其运行；不以非法方式获取或使用枕月APP的任何软件、代码或其他技术或商业信息；不对枕月APP运行的任何程序进行反向工程、反向编译、反向汇编或改写。
    </view>
    <view class="row">
      4.本平台有权视严重情况，对违反本协议的用户采取以下单项或多项措施进行处罚：
    </view>
    <view class="row">（1）暂停/终止提供全部或部分服务；</view>
    <view class="row">（2）删除违规内容；</view>
    <view class="row">（3）暂时/永久封禁；</view>
    <view class="row">
      5.用户违反本协议，导致第三方向神舞科技及其关联公司、合作公司提出索赔等要求的，用户同意承担全部法律责任，包括但不限于赔偿金、罚金、和解费、诉讼仲裁费、合理的律师费支出等，并同意赔偿因此给枕月APP造成的损害。用户承担赔偿责任的方式包括但不限于根据枕月APP的书面通知向其支付与损失等额的资金、以累计的虚拟财产抵偿相关损失等。
    </view>
    <view class="row">
      6、发生下列情形之一时，服务提供方有权中断、停止或变更枕月APP的服务内容，对于因此而产生的困扰、不便或损失，服务提供方不承担任何责任：
    </view>
    <view class="row">
      （1）定期检查维护，软硬件更新等，即暂停服务，服务提供方将尽快完成维修、维护工作；
    </view>
    <view class="row">（2）枕月APP遭到任何形式的破坏，无法正常运作；</view>
    <view class="row">
      （3）网络线路或其它导致用户通过Internet连接至枕月APP的动作发生滞碍等情形；
    </view>
    <view class="row">（4）自然灾害等不可抗力因素；</view>
    <view class="row">
      （5）在紧急情况下为维护国家安全或其它用户及第三者人身安全和重大财产安全时；
    </view>
    <view class="row">（6）发生突发性软硬件设备与电子通信设备故障时。</view>
    <view class="row">
      五、用户隐私制度尊重用户隐私是枕月APP的一项基本政策。枕月APP将按照神舞科技的隐私政策收集、存储、使用、披露和保护您的个人信息。请您完整阅读上述隐私权政策，以帮助您更好地保护您的个人信息。
    </view>
    <view class="row">
      用户在使用枕月APP的过程中，需要同时佩戴服务提供方提供的脑机设备，服务提供方将根据脑机设备记录下来的脑电信号等信息对用户冥想和睡眠进行分析，并生成相应的检测报告；若用户在使用枕月APP的过程中未佩戴服务提供方指定的脑机设备，则不能看到其脑电信号信息，也无法生成评估报告和训练数据。
    </view>
    <view class="row">
      用户可随时联系客服清理注销用户的所有使用记录，含注册时间、训练时间、手机号、邮箱号、性别、年龄、昵称、脑电状态、训练难度、训练效果等信息。客服联系方式为电话：0760-85339772，请务必写明您的手机号和设备SN号，客服会进行验证工作；除下列六项情形之外，服务提供方保证不对外公开或向第三方披露、提供用户信息：
    </view>
    <view class="row">（1）用户(或者用户的监护人)要求或同意服务提供方披露用户信息；</view>
    <view class="row">（2）有关法律、法规、规章或相关规则要求服务提供方披露用户信息；</view>
    <view class="row">（3）司法机关或行政机关基于法定程序要服务提供方披露用户信息；</view>
    <view class="row">
      （4）为保护枕月APP的改及服务提供方的知识产权和其他合法权益，需要披露用户信息；
    </view>
    <view class="row">（5）在紧急情况下为保护其他用户和社会公众的利益，需要披露用户信息；</view>
    <view class="row">
      （6）根据本协议其他条款的规定，服务提供方认为确有必要披露用户信息的其他情况。
    </view>
    <view class="row">
      如为了向用户正常地提供产品和服务，服务提供方可能需要向其技术服务商、关联公司或其他关联第三方披露部分用户信息，在这些第三方承诺其将承担至少与服务提供方同等的保密义务的前提下，服务提供方将向这些第三方传送必要的用户信息，用户对此予以理解和同意。
    </view>
    <view class="row">
      在不透露单个用户隐私资料的前提下，服务提供方有权对整个用户信息数据库进行技术分析并将已进行分析、整理后的用户数据库进行商业上的利用。服务提供方将采取商业上合理可行的方式保护用户个人信息的安全，利用其可以获得的安全技术和程序来保护用户的个人信息不被未经授权地访问、使用或泄漏。但是，对于非因服务提供方的故意及重大过失而造成用户账号的丢失或用户个人信息的泄密，服务提供方不承担任何责任。
    </view>
    <view class="row">六、知识产权</view>
    <view class="row">
      1.本服务中所涉及的图形、文字或其组成，以及其他枕月APP标志及产品、服务名称，均为本平台标识。未经本平台事先书面同意，用户不得将本平台标识以任何方式展示、使用或申请注册商标、进行域名注册等，也不得实施向他人明示或暗示有权展示、使用、或其他有权处理本平台标识的行为。用户由于非法使用本平台标识给本平台或他人造成损失的，由用户承担相关法律责任。
    </view>
    <view class="row">
      2.经由本平台传送的文字、图片、音频、视频及其他内容，受到著作权法、商标法、专利法或其他法律的保护；未经本平台书面授权许可，用户不得自行或许可第三方进行复制、转载、传播、修改、售卖、衍生其他作品或者从事其他侵犯本平台知识产权的行为。
    </view>
    <view class="row">七、免责声明</view>
    <view class="row">
      对于枕月APP提供的产品和服务，服务提供方仅作本条所述有限保证，该有限保证取代任何文档、包装、或其他资料中的任何其他明示或默示的保证(若有)。服务提供方仅保证：
    </view>
    <view class="row">（1）枕月APP提供的产品和服务能基本符合服务提供方正式公布的要求；</view>
    <view class="row">
      （2）枕月APP提供的相关产品和服务基本与服务提供方正式公布的服务承诺相符；
    </view>
    <view class="row">
      （3）枕月APP仅在商业上允许的合理范围内尽力解决用户在享受产品和服务过程中所遇到的任何问题。
    </view>
    <view class="row">
      在法律允许的最大范围内，服务提供方并不担保枕月APP所提供的产品和服务一定能满足用户的要求，也不担保提供的产品和服务不会被中断，并且不担保产品和服务的及时性、安全性及不受干扰，亦不担保无错误发生，以及信息能准确、及时、顺利地传送。
    </view>
    <view class="row">
      用户理解并同意：对于使用枕月APP的产品和服务取得的任何信息、资料，是否信任及使用，完全取决于用户自己，并由用户承担由该等信任及使用带来的系统受损、资料丢失以及其它任何风险。服务提供方对在产品和服务中提及的任何商品购物服务、交易进程、招聘信息，尤其是第三方发出的信息，都不作担保。
    </view>
    <view class="row">
      在法律允许的最大范围内，服务提供方对用户因使用枕月APP的产品和服务引起的任何间接、偶然、意外、特殊或继起的损害（包括但不限于人身伤害、隐私泄漏、因未能履行包括诚信或合理谨慎在内的任何责任、因过失和因任何其他金钱上的损失或其他损失而造成的损害赔偿)不负责任，这些损害可能来自：用户或他人不正当使用产品和服务、在网上购买商品或类似服务、在网上进行交易、非法使用服务或用户传送的信息有所变动。
    </view>
    <view class="row">
      服务提供方对本协议项下涉及的境内外基础电信运营商的固定及移动通信网络的故障，各类技术缺陷、覆盖范围限制、不可抗力、计算机病毒、黑客攻击、用户所在位置、用户关机、合作方因素、他人故意或过失行为或其他非服务提供方技术能力范围内的原因造成的服务中断、用户发送的数据内容丢失、出现乱码、错误接收、无法接收、迟延接收等等，均不承担责任。
    </view>
    <view class="row">八、不可抗力</view>
    <view class="row">
      因不可抗力或其他意外事件，使得本协议的履行不可能、不必要或者无意义的，双方均不承担责任。本协议所称之不可抗力是指不能预见、不能避免并不能克服的客观情况，包括但不限于战争、台风、水灾、火灾、雷击或地震、罢工、暴动、黑客攻击、网络病毒、电子部门技术管制、政府行为或任何其他自然或人为造成的灾难等客观情况。
    </view>
    <view class="row">九、违约赔偿</view>
    <view class="row">
      用户同意保障和维护枕月APP及其他用户的利益，如因用户违反有关法律、法规或本协议项下的任何条款而给枕月APP或任何其他第三方造成损失，用户同意承担由此造成的损害赔偿责任。
    </view>
    <view class="row">
      用户若违反本协议或可适用的法律法规，导致服务提供方的母公司、子公司、其他关联公司、附属机构及其人员，受雇人、代理人及其他一切相关履行辅助人员因此受到损害或支出任何衍生费用(包括但不限于支付上述法律主体须就用户的违约或违法行为所进行的一切辩护或索偿诉讼及相关和解之法律费用)，用户应承担赔偿相关费用及支付损害赔偿的责任。
    </view>
    <view class="row">
      此外，我们仅对本协议条款中列明的责任承担范围负责，用户了解并同意因其违反本协议条款而导致的任何第三方索赔，应且仅应由用户自行承担。
    </view>
    <view class="row">十、法律适用及争议解决</view>
    <view class="row">
      本协议的成立、生效、履行、解释及纠纷解决，均适用中华人民共和国大陆地区法律（不包括冲突法），如果本协议的任何内容与法律相抵触，应以法律规定为准。若用户和服务提供方之间因本协议发生任何纠纷或争议，首先应友好协商解决；协商不成的，双方同意将纠纷或争议提交至服务提供方所在地有管辖权的人民法院管辖。
    </view>
    <view class="row">
      本协议所有条款的标题仅为阅读方便，本身并无实际涵义，不能作为本协议涵义解释的依据。本协议条款无论因何种原因部分无效，其余条款仍有效，对各方具有约束力。
    </view>
    <view class="row">
      本协议项下所有的通知均可通过重要页面公告、电子邮件或常规的信件传送等方式进行；该通知于发送之日视为已送达收件人。
    </view>
    <view class="row">
      如果您对我们的隐私政策及对用户的个人信息的处理有任何疑问、意见、建议或投诉，以及行使用户的个人信息主体权利，请根据本协议载明的联系方式（support@neurodance.cn)与我们进行联系，我们会在验证用户的用户身份后的30个工作日内予以回复。解释权本协议最终解释权为枕月APP服务提供方。本政策版本更新日期为2025年7月10日，将于2025年7月10日正式生效。
    </view>
  </scroll-view>
</template>

<script lang="ts" setup>
//
</script>

<style lang="scss" scoped>
.page {
  position: relative;
  padding: 16px;
  width: 100%;
  box-sizing: border-box;
  display: flex;
  flex-direction: column;
  column-gap: 16px;
  height: calc(100vh - env(safe-area-inset-bottom));
  .row {
    padding: 2px 0;
  }
}
</style>
